<?php
/**
 * Created by PhpStorm.
 * User: Serdenko1
 * Date: 10.10.2016
 * Time: 20:42
 */

var_dump((boolean) 0);

/* Boolean имеет 2 значения - TRUE или FALSE.
 Число 0 считается TRUE, так как только следующие значения рассматриваются как FALSE:

- Сам булев FALSE;

- целое 0 (ноль);

-число с плавающей точкой 0.0 (ноль);

- пустая строка и строка "0";

- массив с нулевыми элементами;

- объект с нулевыми переменными-членами;

- специальный тип NULL (включая неустановленные переменные);

Все остальные значения рассматриваются как TRUE*/
